In [98]:
import pandas as pd
import numpy as np

https://www.youtube.com/watch?v=Id2ZC7YxQZk&list=PL5C9QKu8AsmUK_7AEP0hSmt-8vcE8gnIB&index=6

In [99]:
data = {"Nombre": ["Daniel", "Isabel", "Diana", "Salome", None, "Salome", "Diana", "Daniel", "Salome", "Gaby"],
         "Edad": [40, 39, 39, None, 5, 6, 39, 40, 13, 63],
         "Ciudad": ["Panama", "Tulua", "Buga", "Andalucia", "Sevilla", "Andalucia", "Buga", "Panama", "Andalucia", np.nan ]
         }
df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
3  Salome   NaN  Andalucia
4    None   5.0    Sevilla
5  Salome   6.0  Andalucia
6   Diana  39.0       Buga
7  Daniel  40.0     Panama
8  Salome  13.0  Andalucia
9    Gaby  63.0        NaN

# Limpieza de datos

### Rellenar los valores faltantes

In [100]:
rellenar_datos = df.fillna({
    'Nombre': 'Desconocido',
    'Edad': df['Edad'].mean().round(),
    'Ciudad': 'Desconocida'
})
rellenar_datos

        Nombre  Edad       Ciudad
0       Daniel  40.0       Panama
1       Isabel  39.0        Tulua
2        Diana  39.0         Buga
3       Salome  32.0    Andalucia
4  Desconocido   5.0      Sevilla
5       Salome   6.0    Andalucia
6        Diana  39.0         Buga
7       Daniel  40.0       Panama
8       Salome  13.0    Andalucia
9         Gaby  63.0  Desconocida

### Otra manera de rellenar los valores Vacios:
### Interpolar Valores

In [101]:
df_interpolar = df.copy()
df_interpolar["Edad"] = df["Edad"].interpolate()
df_interpolar

   Nombre  Edad     Ciudad
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
3  Salome  22.0  Andalucia
4    None   5.0    Sevilla
5  Salome   6.0  Andalucia
6   Diana  39.0       Buga
7  Daniel  40.0     Panama
8  Salome  13.0  Andalucia
9    Gaby  63.0        NaN

### Eliminar Filas con valores Faltantes

In [102]:
df_sin_nan = df.dropna()
df_sin_nan

   Nombre  Edad     Ciudad
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
5  Salome   6.0  Andalucia
6   Diana  39.0       Buga
7  Daniel  40.0     Panama
8  Salome  13.0  Andalucia

### Reemplazar valores Especificos de alguna Columna

In [103]:
def_reemplazar = df.replace(
    {
        "Ciudad" : {None: "Desconocida"}
    }
)

def_reemplazar

   Nombre  Edad       Ciudad
0  Daniel  40.0       Panama
1  Isabel  39.0        Tulua
2   Diana  39.0         Buga
3  Salome   NaN    Andalucia
4    None   5.0      Sevilla
5  Salome   6.0    Andalucia
6   Diana  39.0         Buga
7  Daniel  40.0       Panama
8  Salome  13.0    Andalucia
9    Gaby  63.0  Desconocida

### Eliminar Duplicados => Cuando las Filas son Identicas en todas las columnas

In [104]:
df_sin_duplicados = df_sin_nan.drop_duplicates()
df_sin_duplicados

   Nombre  Edad     Ciudad
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
5  Salome   6.0  Andalucia
8  Salome  13.0  Andalucia

### Para Eliminar Duplicados por el nombre de la Columna

In [106]:
df_sin_duplicados = df_sin_nan.drop_duplicates(subset="Nombre", keep="first").reset_index(drop=True)
df_sin_duplicados

   Nombre  Edad     Ciudad
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
3  Salome   6.0  Andalucia

### Renombrar las Columnas

In [107]:
df_renombrado = df_sin_duplicados.rename(columns={"Nombre": "Name", "Edad": "Age", "Ciudad": "City"})
df_renombrado

     Name   Age       City
0  Daniel  40.0     Panama
1  Isabel  39.0      Tulua
2   Diana  39.0       Buga
3  Salome   6.0  Andalucia

### Ordenar Columnas

In [108]:
columnas_ordenadas = ["City", "Name", "Age"]
df_ordenado = df_renombrado[columnas_ordenadas]
df_ordenado

        City    Name   Age
0     Panama  Daniel  40.0
1      Tulua  Isabel  39.0
2       Buga   Diana  39.0
3  Andalucia  Salome   6.0

### Transformacion de Datos

In [116]:
def cuadrado(x): # Función para calcular el cuadrado de un número
    return x ** 2
df_renombrado["Edad_Cuadrado"] = df_renombrado["Age"].apply(cuadrado).round() # Aplicar la función a la columna "Age"
df_renombrado

     Name   Age       City  Edad_Cuadrado
0  Daniel  40.0     Panama         1600.0
1  Isabel  39.0      Tulua         1521.0
2   Diana  39.0       Buga         1521.0
3  Salome   6.0  Andalucia           36.0